# CanBeCopied Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementType..::..CanBeCopied Property
ElementType Class See Also
---
Determine if this ElementType can create a copy
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool CanBeCopied { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanBeCopied As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanBeCopied {
	bool get ();
}
```

# See Also
ElementType Class
Autodesk.Revit.DB Namespace